NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_umac_peripherals.h
/*USBHS*/
#define USBHS_PRESENT 1
#define USBHS_COUNT 1

#define USBHS_HAS_CORE_EVENT 0                       /*!< (unspecified)                                                        */
#define USBHS_HAS_SOF_EVENT 1                        /*!< Has Start of Frame (SOF) event.                                      */
#define USBHS_RTUNE_AVAILABLE 1                      /*!< RTUNE method for calibrating DP and DM 45Ohm source impedance without
                                                          external TXRTUNE resistor available.*/
#define USBHS_HAS_STATUS_REGISTER 0                  /*!< (unspecified)                                                        */

/*Multi serial peripheral interface*/
#define MSPI_PRESENT 1
#define MSPI_COUNT 2

#define MSPI00_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */
#define MSPI00_FIFO_DEPTH 16                         /*!< Depth of the transmit and receive FIFOs is 16                        */
#define MSPI00_CONTROLLER 1                          /*!< MSPI has controller functionality. Tasks, events and registers
                                                          exclusive to this configuration are either labelled or use the
                                                          'CONTROLLER' prefix.*/
#define MSPI00_PERIPHERAL 0                          /*!< MSPI does not have peripheral funtionality                           */
#define MSPI00_XIP 1                                 /*!< MSPI has XiP functionality. Tasks, events and registers exclusive to
                                                          this configuration are either labelled or use the 'XIP' prefix.*/
#define MSPI00_PUBLIC_PINOECONTROL 1                 /*!< PINOECONTROL register is included in public documentation.           */

#define MSPI01_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */
#define MSPI01_FIFO_DEPTH 16                         /*!< Depth of the transmit and receive FIFOs is 16                        */
#define MSPI01_CONTROLLER 1                          /*!< MSPI has controller functionality. Tasks, events and registers
                                                          exclusive to this configuration are either labelled or use the
                                                          'CONTROLLER' prefix.*/
#define MSPI01_PERIPHERAL 1                          /*!< MSPI has peripheral functionality. Tasks, events and registers
                                                          exclusive to this configuration are either labelled or use the
                                                          'PERIPHERAL' prefix.*/
#define MSPI01_XIP 0                                 /*!< MSPI does not have XiP funtionality                                  */
#define MSPI01_PUBLIC_PINOECONTROL 1                 /*!< PINOECONTROL register is included in public documentation.           */

/*2.4 GHz radio*/
#define RADIO_PRESENT 1
#define RADIO_COUNT 1

#define RADIO_IRQ_COUNT 2
#define RADIO_WHITENINGPOLY 1                        /*!< (unspecified)                                                        */
#define RADIO_IEEE802154 1                           /*!< (unspecified)                                                        */
#define RADIO_LONGRANGE 1                            /*!< (unspecified)                                                        */
#define RADIO_DIRECTIONFINDING 1                     /*!< (unspecified)                                                        */
#define RADIO_CHANNELSOUNDING 1                      /*!< (unspecified)                                                        */
#define RADIO_ADPLLCOMPANION_INCLUDE_DMA 0           /*!< (unspecified)                                                        */

/*IPCT APB registers*/
#define IPCT_PRESENT 1
#define IPCT_COUNT 1

#define IPCT10_IRQ_COUNT 4

/*I2C compatible Two-Wire Master Interface with EasyDMA*/
#define TWIM_PRESENT 1
#define TWIM_COUNT 6

#define TWIM20_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM20_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM20_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM20_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM20_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM20_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM21_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM21_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM21_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM21_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM21_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM21_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM22_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM22_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM22_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM22_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM22_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM22_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM23_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM23_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM23_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM23_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM23_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM23_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM24_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM24_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM24_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM24_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM24_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM24_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM30_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM30_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM30_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM30_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM30_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

/*I2C compatible Two-Wire Slave Interface with EasyDMA*/
#define TWIS_PRESENT 1
#define TWIS_COUNT 6

#define TWIS20_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS20_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS20_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS20_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS21_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS21_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS21_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS21_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS22_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS22_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS22_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS22_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS23_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS23_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS23_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS23_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS24_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS24_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS24_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS24_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS30_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS30_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS30_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 1

